## create an Data Frame in Pandas

In [1]:
import pandas as pd

In [2]:
data={
     "rollno":[111,222,333],
    "students": ["ram","shyam", "Rameswaram"],
    "marks":[24,45,67],
    "age":[12,12,34]
}

In [3]:
data2={
    "rollno.":[111,222,333,555],
    "subject":["maths","bio","Hindi","GioGraphy"]
    
}

In [4]:
d= pd.DataFrame(data) 

print("datasets",d)

datasets    rollno    students  marks  age
0     111         ram     24   12
1     222       shyam     45   12
2     333  Rameswaram     67   34

In [5]:
d2= pd.DataFrame(data2) 

print("datasets \n",d2)

datasets
    rollno.    subject
0      111      maths
1      222        bio
2      333      Hindi
3      555  GioGraphy

### access the dataframe data by loc()

In [6]:
print(d.loc[1,"age"])

12

In [7]:
print(d.iloc[[0,1,2]])

   rollno    students  marks  age
0     111         ram     24   12
1     222       shyam     45   12
2     333  Rameswaram     67   34

### how to set indexes by myself

In [8]:
df= pd.DataFrame(data,index=["s1","s2","s3"])

print(df)

    rollno    students  marks  age
s1     111         ram     24   12
s2     222       shyam     45   12
s3     333  Rameswaram     67   34

Print the column name through iteration

In [9]:
for row in df:
    print(row)

rollno
students
marks
age

# DATAFRAME Functions

In [10]:
print(df.dtypes)

rollno       int64
students    object
marks        int64
age          int64
dtype: object

In [11]:
print(df.ndim)

2

In [12]:
print(df.size)

12

In [13]:
print(df.shape)

(3, 4)

In [14]:
print("indexes",df.index)

indexes Index(['s1', 's2', 's3'], dtype='object')

In [15]:
print("teanspose : \n", df.T)

teanspose :
            s1     s2          s3
rollno    111    222         333
students  ram  shyam  Rameswaram
marks      24     45          67
age        12     12          34

In [16]:
print("Top2 Rows \n",df.head(2))

Top2 Rows
     rollno students  marks  age
s1     111      ram     24   12
s2     222    shyam     45   12

In [17]:
print(df.tail())

    rollno    students  marks  age
s1     111         ram     24   12
s2     222       shyam     45   12
s3     333  Rameswaram     67   34

# HOW TO JOIN TO DATA SETS BY USE OF JOIN METHOD

In [18]:
combine= d.join(d2)
print(combine)

   rollno    students  marks  age  rollno. subject
0     111         ram     24   12      111   maths
1     222       shyam     45   12      222     bio
2     333  Rameswaram     67   34      333   Hindi

how to merge two datasets

In [19]:
pd.merge(d2,d,left_on="rollno.",right_on="rollno",how="left"  )

   rollno.    subject  rollno    students  marks   age
0      111      maths   111.0         ram   24.0  12.0
1      222        bio   222.0       shyam   45.0  12.0
2      333      Hindi   333.0  Rameswaram   67.0  34.0
3      555  GioGraphy     NaN         NaN    NaN   NaN

In [20]:
pd.concat([d,d2]).fillna(0)

   rollno    students  marks   age  rollno.    subject
0   111.0         ram   24.0  12.0      0.0          0
1   222.0       shyam   45.0  12.0      0.0          0
2   333.0  Rameswaram   67.0  34.0      0.0          0
0     0.0           0    0.0   0.0    111.0      maths
1     0.0           0    0.0   0.0    222.0        bio
2     0.0           0    0.0   0.0    333.0      Hindi
3     0.0           0    0.0   0.0    555.0  GioGraphy

### Pandas Series

In [21]:
data3=[1,2,3,4,5,32]

In [35]:
series=pd.Series(data3,index=["s1","s2","s3","s4","s5","s6"], dtype="category")
print(series)

s1     1
s2     2
s3     3
s4     4
s5     5
s6    32
dtype: category
Categories (6, int64): [1, 2, 3, 4, 5, 32]

In [ ]:
print(series["s2"])

2

How to work n categories

In [24]:
df=pd.DataFrame(data3, dtype="category")

In [ ]:
print(df)
print(df.dtypes)

    0
0   1
1   2
2   3
3   4
4   5
5  32
0    category
dtype: object

In [46]:
s=series.cat.add_categories([77,88])
print(s)

s1     1
s2     2
s3     3
s4     4
s5     5
s6    32
dtype: category
Categories (8, int64): [1, 2, 3, 4, 5, 32, 77, 88]